app/controllers/cidrs_controller.rb

    def index
      @cidrs=Cidr.all
---
SELECT `cidrs`.* FROM `cidrs`

    def load_file
      data = ''
      #@file = Pathname.new(Gem.loaded_specs['wmap'].full_gem_path).join('data', 'cidrs')
      @file = Rails.root.join('shared','data','cidrs')
---
SELECT `cidrs`.* FROM `cidrs`

    def save_import
      if platinum_user_and_above?
        uid = current_user.id
        existing_cidrs = Cidr.pluck(:owed_cidr)
        data_dir = Rails.root.join('shared', 'data')
        file = data_dir.join('cidrs')
        # Save user import to cache file
        f = File.open(file, 'w+')
        f.write(params[:file_content])
        f.close
        # calculate the cidrs from import
        my_cidrs=Array.new
        params[:file_content].split("\n").map do |x|
          next if x =~ /^\#/
          next if ["",nil].include? x
          my_cidrs.push(x.split(',')[0])
        end
        raise ImportLimitError if my_cidrs.size>10 || my_cidrs.size<1
        # remove user defined obsolete cidrs from db
        cidrs_to_remove = existing_cidrs - my_cidrs
        Cidr.where(:owed_cidr => cidrs_to_remove).delete_all
---
SELECT  `cidrs`.* FROM `cidrs` WHERE `cidrs`.`owed_cidr` = '172.217.0.0/16' LIMIT 1