app/controllers/domains_controller.rb

SELECT  `domains`.* FROM `domains` WHERE (name like '%abc%') LIMIT 10
---
    def search_list
      if params[:keyword].nil? or params[:keyword].empty?
        redirect_back :fallback_location => root_path, :alert => "Unrecognized user input. "
      else
        keyword = "%" + params[:keyword].strip + "%"
      end
      @domains = Domain.where('name like ?', keyword).limit(10)

SELECT  `domains`.* FROM `domains` WHERE `domains`.`name` = 'bradygames.xxx' LIMIT 1
---
    def search
      if params[:keyword].nil? or params[:keyword].empty?
        redirect_back :fallback_location => root_path, :alert => "Unrecognized user input. "
      else
        keyword =  params[:keyword].downcase.strip
      end
      @domain = Domain.find_by(name: keyword)

INSERT INTO `domains` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('youtube.com', 2, '2019-09-25 00:16:11', '2019-09-25 00:16:11')
SELECT  `domains`.* FROM `domains` WHERE `domains`.`name` = 'google.com' LIMIT 1
---
    def save_import
      if platinum_user_and_above?
        uid = current_user.id
        existing_domains = Domain.pluck(:name)
        data_dir = Rails.root.join('shared', 'data')
        # save import to cache file
        file = data_dir.join('domains')
        f = File.open(file, 'w+')
        f.write(params[:file_content])
        f.close
        # calculate the domains from import
        my_domains = Array.new
        params[:file_content].split("\n").map do |x|
          next if x =~ /^\#/
          next if ["",nil].include? x
          my_domains.push(x.split(',')[0])
        end
        raise ImportLimitError if my_domains.size>10
        # remove user defined obsolete domains from db
        domains_to_remove = existing_domains - my_domains
        Domain.where(:name => domains_to_remove).delete_all

SELECT  `domains`.* FROM `domains` ORDER BY name asc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `domains`
---
    def index
      @domains = Domain.all.order(sort_column + " " + sort_direction).page(params[:page]).per_page(25)

SELECT id,keep, COUNT(*) AS total FROM `domains` GROUP BY id, keep
---
    def load_file
      data = ''
      #@file = Pathname.new(Gem.loaded_specs['wmap'].full_gem_path).join('data', 'domains')
      @file = Rails.root.join('shared','data','domains')