app/controllers/domain_map_controller.rb

SELECT `sites`.* FROM `sites` WHERE (site like '%bradygames.xxx%')
---
  def show
    redirect_back :fallback_location => root_path, :alert => "Unknown domain: #{params[:keyword]}" unless params[:keyword]
    @sites = Site.where('site like ?', "%" + params[:keyword] + "%")