app/controllers/hosts_controller.rb

SELECT  `hosts`.* FROM `hosts` ORDER BY host_name asc LIMIT 25 OFFSET 0
---
    def index
      @hosts=Host.all.order(sort_column + " " + sort_direction).page(params[:page]).per_page(25)