app/controllers/reports_controller.rb

  def division
    @reports = Report.where.not(division: [nil,""]).
                      where(category: "domain").
                      order(division: :ASC)
---
SELECT `reports`.* FROM `reports` WHERE NOT ((`reports`.`division` = '' OR `reports`.`division` IS NULL)) AND `reports`.`category` = 'domain' ORDER BY `reports`.`division` ASC

  def tag
    @reports = Report.where.not(division: [nil,""]).
                      where(category: "adware").
                      order(division: :ASC)
---
SELECT `reports`.* FROM `reports` WHERE NOT ((`reports`.`division` = '' OR `reports`.`division` IS NULL)) AND `reports`.`category` = 'adware' ORDER BY `reports`.`division` ASC

  def index
    @reports = Report.all
---
SELECT `reports`.* FROM `reports`

  def show
    report=Report.find(params[:id])
---
SELECT  `reports`.* FROM `reports` WHERE `reports`.`id` = 2 LIMIT 1

  def download_all
    if platinum_user_and_above?
      @domains=Domain.where("name is not null")
---
SELECT `domains`.* FROM `domains` WHERE (name is not null)

    def set_report
      @report = Report.find(params[:id])
---
SELECT  `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1