app/controllers/seed_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def discovery
    #UserMailer.discovery_completion_notice("yli8@yahoo.com", "yesterday", "today").deliver_later
    @user= User.find(current_user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def distest
    @user= User.find(current_user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def confirm_email
    @user = User.find(params[:id])