app/controllers/sites_controller.rb

  def load_file
    data = ''
    data_dir =  Rails.root.join('shared', 'data')
    @file = data_dir.join('sites')
---
SELECT `sites`.* FROM `sites` WHERE (site is not null)

  def index
    @sites=Site.all.order(sort_column + " " + sort_direction).page(params[:page]).per_page(25)
---
SELECT  `sites`.* FROM `sites` ORDER BY site asc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `sites`

  def show
    @site = Site.find(params[:id])
---
SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = 26 LIMIT 1

  def search
      if params[:keyword].nil? or params[:keyword].empty?
        redirect_back :fallback_location => root_path, :alert => "Unrecognized user input. "
      else
        keyword = "%" + params[:keyword].strip + "%"
      end
      @sites = Site.where('site like ?', keyword).limit(10)
---
SELECT  `sites`.* FROM `sites` WHERE (site like '%hire%') LIMIT 10