app/controllers/uploads_controller.rb

  def create
    @upload = Upload.new(upload_params)
    #@upload.attachment = params[:attachment]
    if @upload.save
---
INSERT INTO `uploads` (`name`, `attachment`, `file_type`, `switch_tag`, `created_at`, `updated_at`) VALUES ('DomainPortfolio-division_1.xlsx', NULL, 'division_1', 'division_1', '2019-05-20 19:06:08', '2019-05-20 19:06:08')