app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$11$yu1vIHYz8IN1.TYSqLLf1OKbKHaT.rzT4IypN2D0fX4rBHGFsA2ie', `name` = 'Sam Li', `department` = 'IT', `updated_at` = '2019-11-19 03:38:22' WHERE `users`.`id` = 1
---
  def edit_save
    @user = User.find(params[:id])
    # add the following line to bypass password validations in Rails 4.2
    @user.password = "!@#$%^&*----"
    @user.name = params[:name]
    @user.email = params[:email]
    @user.department = params[:department]
    if @user.save!

SELECT `users`.* FROM `users` ORDER BY username asc
---
  def index
    @users = User.order(sort_column + " " + sort_direction)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$11$8DwaNLxQhOQtB34iembU5.BYmbVF/jY/XXNyW6J.JZgfoRzemFzRu', `updated_at` = '2019-11-19 04:19:24' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    # add the following line to bypass password validations in Rails 4.2
    @user.password = "!@#$%^&*----"
    #render plain: secure_params.inspect
#=begin
    if @user.update!(secure_params)